#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_subnetwork.jade-subnetwork will be updated in-place
  ~ resource "google_compute_subnetwork" "jade-subnetwork" {
        creation_timestamp       = "2019-07-09T07:46:37.292-07:00"
        enable_flow_logs         = false
        fingerprint              = "vFghAQNhJZ8="
        gateway_address          = "10.0.0.1"
        id                       = "us-central1/dev-subnet"
        ip_cidr_range            = "10.0.0.0/22"
        name                     = "dev-subnet"
        network                  = "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/global/networks/dev-network"
        private_ip_google_access = true
        project                  = "broad-jade-dev"
        region                   = "us-central1"
      ~ secondary_ip_range       = [
          ~ {
              ~ ip_cidr_range = "10.0.16.0/20" -> "10.48.0.0/14"
              ~ range_name    = "gke-dev-master-services-7ae136da" -> "pods"
            },
          ~ {
              ~ ip_cidr_range = "10.48.0.0/14" -> "10.0.16.0/20"
              ~ range_name    = "gke-dev-master-pods-7ae136da" -> "services"
            },
        ]
        self_link                = "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/regions/us-central1/subnetworks/dev-subnet"

        timeouts {}
    }

  # google_sql_database_instance.jade_100_postgres[0] must be replaced
-/+ resource "google_sql_database_instance" "jade_100_postgres" {
      ~ connection_name               = "broad-jade-dev:us-central1:jade-postgres-101-987f0c3b501aeabf" -> (known after apply)
      ~ database_version              = "POSTGRES_9_6" -> "POSTGRES_11" # forces replacement
      + encryption_key_name           = (known after apply)
      ~ first_ip_address              = "10.12.0.6" -> (known after apply)
      ~ id                            = "jade-postgres-101-987f0c3b501aeabf" -> (known after apply)
      ~ ip_address                    = [
          - {
              - ip_address     = "10.12.0.6"
              - time_to_retire = ""
              - type           = "PRIVATE"
            },
        ] -> (known after apply)
      + master_instance_name          = (known after apply)
        name                          = "jade-postgres-101-987f0c3b501aeabf"
      ~ private_ip_address            = "10.12.0.6" -> (known after apply)
      ~ project                       = "broad-jade-dev" -> (known after apply)
      + public_ip_address             = (known after apply)
        region                        = "us-central1"
      ~ self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/broad-jade-dev/instances/jade-postgres-101-987f0c3b501aeabf" -> (known after apply)
      ~ server_ca_cert                = [
          - {
              - cert             = "-----BEGIN CERTIFICATE-----\nMIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ5YThm\nZjQyYi1iY2NmLTRkYjgtOGJiOS0zN2RiMTkyYzk3OGIxIzAhBgNVBAMTGkdvb2ds\nZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG\nA1UEBhMCVVMwHhcNMTkwNzMxMTQzODQ1WhcNMjkwNzI4MTQzOTQ1WjB3MS0wKwYD\nVQQuEyQ5YThmZjQyYi1iY2NmLTRkYjgtOGJiOS0zN2RiMTkyYzk3OGIxIzAhBgNV\nBAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs\nIEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB\nAQCqKBda+0Qmmtvkx3+LgyI+ZJMvajnnSnScL9fRCmaY7gN9nb4EDMi9SJ4oluDE\nB829mHD7xkDuDiaW8A8L6mh4rTM3EYCsUUhsiSePLsvmXj+PHLBTDsUXNM4Vgxx8\nuzJB1ULpSVzk+17W0LvB5U+CDyoOfg9SSsy+El5VBaKiKAPOMFkF4IOR2W0EGlQp\nCyTZXEWXTmFXDED7tJDngMrYE81F11mypJmzG9tKD2JtAQ852kZUkWcpg4lVfa2R\nL9FKqrpM9xLDoT7qoogvXTwL0EIH8MCriDD9KCXOkHseigMp8/2qSMjbKqTveGWN\n5hwROEKV4il1DhFbddlAJXcTAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw\nDQYJKoZIhvcNAQELBQADggEBADU/0+DX2TGjeKvoUockhjLXYDDHxv43TeT+0fyB\nUxV4x5+T7j5YyJ5PBlRoj8qg5xl1Zf1NxLCslrmRDDXZBNTuGYL/3vYmADdKgUhc\nysT2lmRc3OmFNQ2GpuPM+B070XdylfMAah1t0O18/o4vqfNGjQBFN7/ZUcY4OehE\nDCQUYnS1AW9bWQgAFKkPCumrxNXmpRivlZZhDCfwXysC0BFmvyzlRkFsxQKwAw3c\n95JVneGXyE+WIPdtszPpw+IpzQbNosGS0ikF20RM83ufkzHz8WtTfzvhDu5LsU0Y\ncG3aI/HmK2vbIv7+wH1ccCMM4TvUoOVrE2WMSVFriHqeGp4=\n-----END CERTIFICATE-----"
              - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=9a8ff42b-bccf-4db8-8bb9-37db192c978b"
              - create_time      = "2019-07-31T14:38:45.727Z"
              - expiration_time  = "2029-07-28T14:39:45.727Z"
              - sha1_fingerprint = "945b8cf6260bc3075da8c95f377a40c5e50dab1a"
            },
        ] -> (known after apply)
      ~ service_account_email_address = "p970791974390-vtbiet@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      ~ settings {
            activation_policy           = "ALWAYS"
          - authorized_gae_applications = [] -> null
          ~ availability_type           = "ZONAL" -> (known after apply)
          ~ crash_safe_replication      = false -> (known after apply)
            disk_autoresize             = true
          ~ disk_size                   = 10 -> (known after apply)
          ~ disk_type                   = "PD_SSD" -> (known after apply)
            pricing_plan                = "PER_USE"
            replication_type            = "SYNCHRONOUS"
            tier                        = "db-g1-small"
            user_labels                 = {
                "app"   = "jade"
                "role"  = "database"
                "state" = "active"
            }
          ~ version                     = 25 -> (known after apply)

          ~ backup_configuration {
                binary_log_enabled = false
                enabled            = true
                start_time         = "06:00"
            }

            database_flags {
                name  = "max_connections"
                value = "1024"
            }

          ~ ip_configuration {
                ipv4_enabled    = false
              ~ private_network = "projects/broad-jade-dev/global/networks/dev-network" -> "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/global/networks/dev-network"
                require_ssl     = true

                authorized_networks {
                    name  = "Broad"
                    value = "69.173.64.0/18"
                }
                authorized_networks {
                    name  = "kubernetes"
                    value = "130.211.9.232"
                }
            }

          ~ location_preference {
              + follow_gae_application = (known after apply)
              ~ zone                   = "us-central1-b" -> (known after apply)
            }
        }

      - timeouts {}
    }

  # module.initials-dns-set.google_dns_record_set.set_dns_record["jade-global-ms"] will be updated in-place
  ~ resource "google_dns_record_set" "set_dns_record" {
        id           = "datarepo-dev/jade-global-ms.datarepo-dev.broadinstitute.org./A"
        managed_zone = "datarepo-dev"
        name         = "jade-global-ms.datarepo-dev.broadinstitute.org."
        project      = "broad-jade-dev"
      ~ rrdatas      = [
          - "35.201.107.168",
          + "34.107.142.18",
        ]
        ttl          = 300
        type         = "A"
    }

  # module.k8s-master.google_container_cluster.cluster must be replaced
-/+ resource "google_container_cluster" "cluster" {
      + additional_zones            = (known after apply)
      ~ cluster_ipv4_cidr           = "10.48.0.0/14" -> (known after apply)
      ~ default_max_pods_per_node   = 110 -> (known after apply)
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
      ~ endpoint                    = "35.224.190.223" -> (known after apply)
      ~ id                          = "projects/broad-jade-dev/locations/us-central1/clusters/dev-master" -> (known after apply)
        initial_node_count          = 1
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/beta/projects/broad-jade-dev/zones/us-central1-a/instanceGroups/gke-dev-master-dev-node-d3a1d314-grp",
          - "https://www.googleapis.com/compute/beta/projects/broad-jade-dev/zones/us-central1-c/instanceGroups/gke-dev-master-dev-node-a5f5f478-grp",
          - "https://www.googleapis.com/compute/beta/projects/broad-jade-dev/zones/us-central1-f/instanceGroups/gke-dev-master-dev-node-b471c5eb-grp",
        ] -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
        location                    = "us-central1"
        logging_service             = "logging.googleapis.com/kubernetes"
      ~ master_version              = "1.15.11-gke.5" -> (known after apply)
      ~ min_master_version          = "1.15.11-gke.5" -> "1.15.9-gke.24"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "dev-master"
      ~ network                     = "projects/broad-jade-dev/global/networks/dev-network" -> "dev-network"
      ~ node_locations              = [
          - "us-central1-a",
          - "us-central1-c",
          - "us-central1-f",
        ] -> (known after apply)
      ~ node_version                = "1.15.9-gke.24" -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "broad-jade-dev" -> (known after apply)
      + region                      = (known after apply)
        remove_default_node_pool    = true
      - resource_labels             = {} -> null
      ~ services_ipv4_cidr          = "10.0.16.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/broad-jade-dev/regions/us-central1/subnetworks/dev-subnet" -> "dev-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
      + zone                        = (known after apply)

      ~ addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + istio_config {
              + disabled = true
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

            network_policy_config {
                disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      ~ cluster_autoscaling {
          ~ autoscaling_profile = "BALANCED" -> (known after apply)
          ~ enabled             = false -> (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      ~ database_encryption {
          + key_name = (known after apply)
          ~ state    = "DECRYPTED" -> (known after apply)
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.48.0.0/14" -> (known after apply)
          ~ cluster_secondary_range_name  = "gke-dev-master-pods-7ae136da" -> "pods" # forces replacement
          + node_ipv4_cidr_block          = (known after apply)
          ~ services_ipv4_cidr_block      = "10.0.16.0/20" -> (known after apply)
          ~ services_secondary_range_name = "gke-dev-master-services-7ae136da" -> "services" # forces replacement
          + subnetwork_name               = (known after apply)
        }

      ~ master_auth {
          ~ client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMyekNDQWNPZ0F3SUJBZ0lSQUx3T0dBOUZORU0wem1UaWlQZE5BRGN3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1ptRmxOV1JpTVdNdE16RXhNUzAwT1RoaUxXSmhOamN0TjJZd1pXTXlPRGcyTVRNegpNQjRYRFRJd01ERXhNekU1TXpnME1sb1hEVEkxTURFeE1URTVNemcwTWxvd0VURVBNQTBHQTFVRUF4TUdZMnhwClpXNTBNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXFHbTJuOGNQTE0xSEE4QzYKV283RCtjanBlM2drRDBZSjJ6d21RUHdsbW5mdzU5dXUrYUxWd2YwcHlyTngyazlHSVBHSi8vMkdFWU1xaUJmLwpzamZQSDBzVG1DZVJHTkZLRHNZN3M1Y1JmK0UwbDBROFJmdDd5QzdSYlNKdXlYTFAwRkd3YTltcmRsRkFNSGJCCm1hVnowMUJxYkx2cVpXVGJvR25PN2JZN25XeDZKOFh1Zk1oM3lWZTI5Z1V5Rm5EU0xMRnNQUlNXT2JCRlNRWnAKcEtUbVBYUEJxWnpUOHMva0oxYzdJVzdkZ3dUcm1yaHBqZXFRVmxDNURiTmVFL2RjYmRvRHJKTUkxNTRYTTRwMgoxWW90RzdLa25ic3E3ZWdHL1Urek1YcEdFQ0c0ZE5tYy9LR0dsakswcVVqMUVQb3FOTENIcWgxY2VhcUFYRDNRCmtBZVVaUUlEQVFBQm94QXdEakFNQmdOVkhSTUJBZjhFQWpBQU1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQzEKUlh4ZVRCL2NaeWI4aXpDd0xNMTFKMFRDN3RxL3JFUFRIT1d2UnNOb2FpektnMVBiaVhER3E1VjNXTng4M2pySAp4OEtqWlpyT0UwU2lxeS9BVWNUYkgvdGNudXIzR1hpa1BmUDlrNzFRUUJPYmMvZzFRNTJNdm5FbHdWV2dFTHRNCkEwQ1M1cHRFVnRJb3NkVzhNMUFvRFNyY0NhSkVyRVlVbUlqRHBjUG9oVXlsb3pYclRpaFUxeExZZE9HKzhYTjcKK0RvbUJrQk5yUXIrYU9XQmREallIcVRUVlNMNEdsbFViNHN0ajB6Tm1iOHZESTJqQWphcExHNnAwWC9mSjBUbAp6ZlF0clBBRXVPMUZkUkNVU1BPcjN6UGI3WmxybG1aVG92TThNZ2hyQm1UMVU2RTRVbzd2RDBLMTN4UEd5Qmp5ClRRbjJnamMyRFJCZjZPcjM3U0JOCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURERENDQWZTZ0F3SUJBZ0lSQUxLcWVpWWNnZ3dHNnFxL0RsRGpHTm93RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1ptRmxOV1JpTVdNdE16RXhNUzAwT1RoaUxXSmhOamN0TjJZd1pXTXlPRGcyTVRNegpNQjRYRFRJd01ERXhNekU0TXpnME1Wb1hEVEkxTURFeE1URTVNemcwTVZvd0x6RXRNQ3NHQTFVRUF4TWtabUZsCk5XUmlNV010TXpFeE1TMDBPVGhpTFdKaE5qY3ROMll3WldNeU9EZzJNVE16TUlJQklqQU5CZ2txaGtpRzl3MEIKQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBM0VrbUhvbUxmL0UxTG43VERVeTNJUy9VVjNsTkk1aFV1Q0FHNjdicQorb0FnVlRGY2FVY0NmVld1WG9XS0k2a1NKRlFHdFlob2JGMUJuNjY2dXAvcFhBOUNBNkVqVGs0SDIyalcyMmxVCndBdTlGN21CMk16VnZLcVJycFEyVnpPeSs5emNVMnUyc3V2OEM1UTFScGhGTnpyVXJTaUErZSs5Qy90VGpqWTQKZFlhbGlSdjZvRjJVMWdrQ1hXWDFGUmRqL3ZzZHVxM2pEM1gvQy9XV1I4U0FNbzdSQU5vRzQyeXk4ZUh1N3dHOQovVFZja3RyMVFYZnpNeW5Tbko4d1o2N3loZWRIblp4cTU1dzhVbmNKaWhIZDJDUDI0SFdMTVFNNmZ4VERWT2loCnE1Q0pXd3BzOHRadXdGNWRFdFhsYVh6Q1hoWkk2enNRMkxlNm9kaFR3c045NFFJREFRQUJveU13SVRBT0JnTlYKSFE4QkFmOEVCQU1DQWdRd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBTkJna3Foa2lHOXcwQkFRc0ZBQU9DQVFFQQpUdTMxZFdaTkwwdHVyb3lvQXp4OTRRVDhyVzE3NWZrdC9zT1Jmalhkd0E5THVWYmxzN0tMNUJlQXhrL1RIWnFtCmJ2SzJJMHlXOHNXVXc1eVlGMFczTEIzZmtzYUo2SWp2dCt0ZC9sYlNJRFhNS2FyQ2ZpS1cyNHVRbWo3R1RyU2cKM3RJcU9DZ0U4K2gxc0ozaVJ4TkRkMyt5VWlWNmFQVVBiTEYzTXAraFRnQnpIYTYxTHVnZFJhY1FsMlVNN2xPQgorTFR1WWxjVHBhQTZ3OUE2OUd2b1ZQbDhmTFJuNm56UFp1MWxOelZWeldFMlg3VGNCMWdTUjA4djNtem1teUxzCnVicS9ZeXErb0kwOWxjV05VU2Nkdk0rQmJnYks2czMwNHluVEx6Nm5WaVNhM2NFN25NWmU2SG1oUW1qWitlekIKYXE1VnNGRjZsTlpza2NSNk0zNUVOUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            client_certificate_config {
                issue_client_certificate = true
            }
        }

      - master_authorized_networks_config {
          - cidr_blocks {
              - cidr_block = "69.173.112.0/21" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.120.0/22" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.124.0/23" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.126.0/24" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.0/25" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.128/26" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.192/27" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.224/30" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.228/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.230/31" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.232/29" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.240/28" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.64.0/19" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.96.0/20" -> null
            }
        }

      ~ network_policy {
            enabled = true
        }

      ~ node_config {
          + boot_disk_kms_key = (known after apply)
          ~ disk_size_gb      = 50 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS" -> (known after apply)
          ~ labels            = {
              - "environment" = "dev"
              - "project"     = "jade"
            } -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-standard-2" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints"         = "true"
              - "google-compute-enable-virtio-rng" = "false"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/compute",
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> (known after apply)
          ~ preemptible       = false -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
          ~ tags              = [
              - "jade",
              - "dev",
              - "kubernetes",
            ] -> (known after apply)
          ~ taint             = [] -> (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          ~ workload_metadata_config {
              ~ node_metadata = "SECURE" -> (known after apply)
            }
        }

      ~ node_pool {
          ~ initial_node_count  = 3 -> (known after apply)
          ~ instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/zones/us-central1-a/instanceGroupManagers/gke-dev-master-dev-node-d3a1d314-grp",
              - "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/zones/us-central1-c/instanceGroupManagers/gke-dev-master-dev-node-a5f5f478-grp",
              - "https://www.googleapis.com/compute/v1/projects/broad-jade-dev/zones/us-central1-f/instanceGroupManagers/gke-dev-master-dev-node-b471c5eb-grp",
            ] -> (known after apply)
          ~ max_pods_per_node   = 110 -> (known after apply)
          ~ name                = "dev-node" -> (known after apply)
          + name_prefix         = (known after apply)
          ~ node_count          = 1 -> (known after apply)
          ~ node_locations      = [
              - "us-central1-a",
              - "us-central1-c",
              - "us-central1-f",
            ] -> (known after apply)
          ~ version             = "1.15.9-gke.24" -> (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          ~ management {
              ~ auto_repair  = true -> (known after apply)
              ~ auto_upgrade = true -> (known after apply)
            }

          ~ node_config {
              + boot_disk_kms_key = (known after apply)
              ~ disk_size_gb      = 50 -> (known after apply)
              ~ disk_type         = "pd-standard" -> (known after apply)
              ~ guest_accelerator = [] -> (known after apply)
              ~ image_type        = "COS" -> (known after apply)
              ~ labels            = {
                  - "environment" = "dev"
                  - "project"     = "jade"
                } -> (known after apply)
              ~ local_ssd_count   = 0 -> (known after apply)
              ~ machine_type      = "n1-standard-2" -> (known after apply)
              ~ metadata          = {
                  - "disable-legacy-endpoints"         = "true"
                  - "google-compute-enable-virtio-rng" = "false"
                } -> (known after apply)
              + min_cpu_platform  = (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/compute",
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> (known after apply)
              ~ preemptible       = false -> (known after apply)
              ~ service_account   = "default" -> (known after apply)
              ~ tags              = [
                  - "jade",
                  - "dev",
                  - "kubernetes",
                ] -> (known after apply)
              ~ taint             = [] -> (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              ~ shielded_instance_config {
                  ~ enable_integrity_monitoring = true -> (known after apply)
                  ~ enable_secure_boot          = false -> (known after apply)
                }

              ~ workload_metadata_config {
                  ~ node_metadata = "SECURE" -> (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

        pod_security_policy_config {
            enabled = true
        }

      ~ private_cluster_config {
          - enable_private_endpoint = false -> null
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.127.0.0/28"
          ~ peering_name            = "gke-7ae136da26f1b146a914-c54d-8be5-peer" -> (known after apply)
          ~ private_endpoint        = "10.127.0.2" -> (known after apply)
          ~ public_endpoint         = "35.224.190.223" -> (known after apply)
        }

      ~ release_channel {
          ~ channel = "UNSPECIFIED" -> "REGULAR" # forces replacement
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
